{
    "D:\\Sem6\\Labs\\MLT": {
        "folder_path": "D:\\Sem6\\Labs\\MLT",
        "timestamp": "2025-03-01T20:29:38.711871",
        "summary": {
            "total_files": 17,
            "total_folders": 1,
            "file_types": {
                "application/vnd.openxmlformats-officedocument.wordprocessingml.document": 6,
                "application/pdf": 7,
                "application/vnd.ms-excel": 1
            },
            "largest_file": "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex2.ipynb - Colab.pdf",
            "largest_size": 1048213
        },
        "details": [
            "Ex2 - Feature Selection and Extraction .docx (application/vnd.openxmlformats-officedocument.wordprocessingml.document, 11.36 KB)",
            "MLTex1a.pdf (application/pdf, 506.39 KB)",
            "MLTex1b.pdf (application/pdf, 438.60 KB)",
            "Rakesh.docx (application/vnd.openxmlformats-officedocument.wordprocessingml.document, 131.61 KB)",
            "Rakesh_MLT_Ex1a.docx (application/vnd.openxmlformats-officedocument.wordprocessingml.document, 964.23 KB)",
            "Rakesh_MLT_Ex1a.ipynb (Unknown, 55.18 KB)",
            "Rakesh_MLT_Ex1a.pdf (application/pdf, 330.13 KB)",
            "Rakesh_MLT_Ex1b.docx (application/vnd.openxmlformats-officedocument.wordprocessingml.document, 548.83 KB)",
            "Rakesh_MLT_Ex1b.ipynb (Unknown, 11.53 KB)",
            "Rakesh_MLT_Ex1b.pdf (application/pdf, 220.86 KB)"
        ],
        "file_contents": {
            "D:\\Sem6\\Labs\\MLT\\Ex2 - Feature Selection and Extraction .docx": " ",
            "D:\\Sem6\\Labs\\MLT\\MLTex1a.pdf": "1 \n  \nEx No 1a   \nExploratory Data Analysis   \nReg.No: \nURK22CS7112  Date:  \n Aim:  \nTo perform the initial investigations and analysis on the given dataset & summarize the \ncharacteristics of the given dataset using python implementation.  \nDescription:  \nExploratory Data Analysis refers to the critical process of performing initial investigations on data \nso as to discover patterns to spot anomalies to test hypothesis and to check assumptions with \nthe help of summary statistics and graphical ",
            "D:\\Sem6\\Labs\\MLT\\MLTex1b.pdf": "8 \n  \nEx No 1b   \nData Preprocessing   \nReg No:  \n \nURK22CS7112  Date:  \n Aim:  \nTo prepare the data suitable for the machine learning model, perform data cleaning, - data reduction and \ndata transformation on the given dataset using python implementation.  \nDescription:  \nData preprocessing is a process of preparing the raw data and making it suitable for a machine learning \nmodel.  \n● Data cleaning can be applied to “clean” the data by filling in missing values, smoothing noisy \ndata, identify",
            "D:\\Sem6\\Labs\\MLT\\Rakesh.docx": " ",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1a.docx": " It’s a good practice to remove correlated variables during feature selection(which less contributes with the target variable), to improve the model If correlation is zero, there is no linear relationship between these two variables, so it is safe to drop these features Pearson correlation coefficient or Spearman correlation coefficient  3) Univariate, Bivariate and Multivariate analysis  Univariate - analyzing only one variable. Bivariate - comparing two variables to study their relationships. ",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1a.ipynb": "Content reading not supported for this file type.",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1a.pdf": "1  Ex No 1a  \nExploratory  Data  Analysis   \nReg.No: \nURK22CS71 21 Date:  \nAim:  \nTo perform  the initial  investigations  and analysis  on the given  dataset  & summarize  the \ncharacteristics of the given dataset using python implementation.  \nDescription:  \nExploratory  Data Analysis  refers  to the critical  process  of performing  initial  investigations  on data \nso as to discover patterns to spot anomalies to test hypothesis and to check assumptions with \nthe help of summary statistics an",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1b.docx": " Drop the outliers Drop duplicates  DATA TRANSFORMATION:   Data transformation is a technique used to convert the raw data into a suitable format.  Normalization - Data normalization involves converting all data variable into a given range. Min-max - This method implements a linear transformation on the original Data Z-score – This method normalizes the value using the mean and standard deviation Encoding method - convert the categorical features into its numeric representation. Label encoding -",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1b.ipynb": "Content reading not supported for this file type.",
            "D:\\Sem6\\Labs\\MLT\\Rakesh_MLT_Ex1b.pdf": "8  Ex No 1b  \nData  Preprocessing   \nReg No: \nURK22CS71 21 Date:  \nAim:  \nTo prepare  the data suitable  for the machine  learning  model,  perform  data cleaning, - data reduction  and \ndata transformation on the given dataset using python implementation.  \nDescription:  \nData  preprocessing  is a process  of preparing  the raw data and making  it suitable  for a machine  learning \nmodel.  \n● Data  cleaning  can be applied  to “clean”  the data by filling  in missing  values,  smoothing  noisy "
        },
        "description": "This folder appears to contain materials for a Machine Learning (ML) course, specifically focusing on labs for a module likely titled \"MLT\".  There are 17 files and 1 subfolder.  The files are predominantly .docx and .pdf documents, with a few .ipynb files (Jupyter Notebooks).  The largest file is a PDF, exceeding 1MB.\n\nThe documents seem to be student work relating to two experiments (Ex1a and Ex1b, and potentially Ex2).  The content snippets reveal a focus on Exploratory Data Analysis (EDA) and Data Preprocessing.  \n\nEx1a covers EDA, including initial data investigation and summarizing dataset characteristics using Python. Ex1b focuses on Data Preprocessing, detailing data cleaning (handling missing values and noisy data), data reduction, and data transformation techniques such as normalization (min-max and Z-score) and encoding categorical features.  There are also mentions of handling outliers and duplicates.  A separate document (Rakesh_MLT_Ex1a.docx) also briefly touches upon feature selection, mentioning correlation analysis and univariate/bivariate/multivariate analysis.  The .ipynb files are likely code implementations related to these experiments, but their contents cannot be viewed.  Finally, there's mention of an \"Ex2\" which appears to relate to Feature Selection and Extraction.\n\nIn short, the folder is a well-organized collection of student lab work centered around essential data science concepts and their practical application in Python.\n"
    }
}